In [1]:
import pandas as pd
from datasets import load_dataset 
import matplotlib.pyplot as plt

#loading data
dataset=load_dataset('lukebarousse/data_jobs')
df=dataset['train'].to_pandas()

#cleaning data
df['job_posted_data']=pd.to_datetime(df['job_posted_date'])

c:\Users\aahme\anaconda3\envs\python_course\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [2]:
df.loc[0:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [3]:
median_salary_year=df['salary_year_avg'].median()

In [4]:
median_salary_hour=df['salary_hour_avg'].median()

In [5]:
#filling nan values with median

df_filled=df

df_filled['salary_year_avg']=df_filled['salary_year_avg'].fillna(median_salary_year)


df_filled['salary_hour_avg']=df_filled['salary_hour_avg'].fillna(median_salary_hour)

df.loc[0:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [6]:
df_unique=df_filled

In [7]:
df_unique=df_unique.drop_duplicates()

In [8]:
df_unique=df_unique.drop_duplicates(['job_title','company_name'])